project3/report_endurance-15m/statistics.json
{
  "List Users" : {
    "transaction" : "List Users",
    "sampleCount" : 47218,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 183.9809818289638,
    "medianResTime" : 158.0,
    "minResTime" : 2.0,
    "maxResTime" : 1283.0,
    "pct1ResTime" : 325.0,
    "pct2ResTime" : 392.0,
    "pct3ResTime" : 549.0,
    "throughput" : 52.454070195005876,
    "receivedKBytesPerSec" : 6483.5804132279945,
    "sentKBytesPerSec" : 6.351860062676493
  },
  "User Workflow" : {
    "transaction" : "User Workflow",
    "sampleCount" : 47208,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 553.2795712591123,
    "medianResTime" : 541.0,
    "minResTime" : 15.0,
    "maxResTime" : 1935.0,
    "pct1ResTime" : 806.0,
    "pct2ResTime" : 905.0,
    "pct3ResTime" : 1108.0,
    "throughput" : 52.44103882312036,
    "receivedKBytesPerSec" : 6522.450140335155,
    "sentKBytesPerSec" : 31.513349717455128
  },
  "Delete User" : {
    "transaction" : "Delete User",
    "sampleCount" : 47208,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 182.20769784782385,
    "medianResTime" : 157.0,
    "minResTime" : 1.0,
    "maxResTime" : 1217.0,
    "pct1ResTime" : 316.90000000000146,
    "pct2ResTime" : 388.0,
    "pct3ResTime" : 551.0,
    "throughput" : 52.44703968857071,
    "receivedKBytesPerSec" : 18.28475895392553,
    "sentKBytesPerSec" : 13.043933859881259
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 141656,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 184.43103716044652,
    "medianResTime" : 160.0,
    "minResTime" : 1.0,
    "maxResTime" : 1283.0,
    "pct1ResTime" : 323.0,
    "pct2ResTime" : 390.0,
    "pct3ResTime" : 548.9900000000016,
    "throughput" : 157.35341980647405,
    "receivedKBytesPerSec" : 6523.61420723902,
    "sentKBytesPerSec" : 31.519293123660777
  },
  "Create User" : {
    "transaction" : "Create User",
    "sampleCount" : 47230,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 187.10328181240678,
    "medianResTime" : 160.0,
    "minResTime" : 7.0,
    "maxResTime" : 1217.0,
    "pct1ResTime" : 327.0,
    "pct2ResTime" : 393.0,
    "pct3ResTime" : 548.9900000000016,
    "throughput" : 52.46372915697019,
    "receivedKBytesPerSec" : 22.205465545129027,
    "sentKBytesPerSec" : 12.125870799805275
  }
}