project3/report_load_100/statistics.json
{
  "List Users" : {
    "transaction" : "List Users",
    "sampleCount" : 6186,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 641.0974781765275,
    "medianResTime" : 565.0,
    "minResTime" : 1.0,
    "maxResTime" : 3003.0,
    "pct1ResTime" : 1111.3000000000002,
    "pct2ResTime" : 1406.2999999999993,
    "pct3ResTime" : 1867.13,
    "throughput" : 51.335673562874995,
    "receivedKBytesPerSec" : 2696.8054531186463,
    "sentKBytesPerSec" : 6.216429220504394
  },
  "User Workflow" : {
    "transaction" : "User Workflow",
    "sampleCount" : 6152,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1863.9567620286116,
    "medianResTime" : 1732.0,
    "minResTime" : 12.0,
    "maxResTime" : 6447.0,
    "pct1ResTime" : 2876.7,
    "pct2ResTime" : 3218.0,
    "pct3ResTime" : 3986.290000000002,
    "throughput" : 51.035729988468844,
    "receivedKBytesPerSec" : 2720.4141170059647,
    "sentKBytesPerSec" : 30.694003514306097
  },
  "Delete User" : {
    "transaction" : "Delete User",
    "sampleCount" : 6152,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 603.7812093628106,
    "medianResTime" : 544.0,
    "minResTime" : 5.0,
    "maxResTime" : 3798.0,
    "pct1ResTime" : 1060.0,
    "pct2ResTime" : 1347.0,
    "pct3ResTime" : 1792.4700000000003,
    "throughput" : 51.0831928656243,
    "receivedKBytesPerSec" : 17.809277200222535,
    "sentKBytesPerSec" : 12.717320044776677
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 18563,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 621.3530140602309,
    "medianResTime" : 552.0,
    "minResTime" : 1.0,
    "maxResTime" : 3798.0,
    "pct1ResTime" : 1084.0,
    "pct2ResTime" : 1378.0,
    "pct3ResTime" : 1836.0,
    "throughput" : 153.9871753394885,
    "receivedKBytesPerSec" : 2735.3553942535814,
    "sentKBytesPerSec" : 30.86675173321637
  },
  "Create User" : {
    "transaction" : "Create User",
    "sampleCount" : 6225,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 619.0979919678703,
    "medianResTime" : 547.0,
    "minResTime" : 5.0,
    "maxResTime" : 3759.0,
    "pct1ResTime" : 1096.0,
    "pct2ResTime" : 1386.6999999999998,
    "pct3ResTime" : 1840.1799999999985,
    "throughput" : 51.656750230277076,
    "receivedKBytesPerSec" : 21.839515157833155,
    "sentKBytesPerSec" : 11.952090309069183
  }
}