project3/report_stress-200/statistics.json
{
  "List Users" : {
    "transaction" : "List Users",
    "sampleCount" : 696048,
    "errorCount" : 690333,
    "errorPct" : 99.17893,
    "meanResTime" : 8.363770889364064,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 5012.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 53.0,
    "throughput" : 5756.459029408846,
    "receivedKBytesPerSec" : 10704.846139313657,
    "sentKBytesPerSec" : 351.34573019699627
  },
  "User Workflow" : {
    "transaction" : "User Workflow",
    "sampleCount" : 695985,
    "errorCount" : 690444,
    "errorPct" : 99.203865,
    "meanResTime" : 25.528278626694405,
    "medianResTime" : 5.0,
    "minResTime" : 0.0,
    "maxResTime" : 13175.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 1017.0,
    "throughput" : 5750.373864978973,
    "receivedKBytesPerSec" : 25921.917319617893,
    "sentKBytesPerSec" : 1644.6448715174786
  },
  "Delete User" : {
    "transaction" : "Delete User",
    "sampleCount" : 695985,
    "errorCount" : 690444,
    "errorPct" : 99.203865,
    "meanResTime" : 8.338984317190915,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 5015.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 54.0,
    "throughput" : 5756.080818439705,
    "receivedKBytesPerSec" : 7635.670911755767,
    "sentKBytesPerSec" : 622.1453276968771
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2088148,
    "errorCount" : 2071145,
    "errorPct" : 99.18574,
    "meanResTime" : 8.583578845943531,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 5015.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 456.950000000008,
    "throughput" : 17259.98908928601,
    "receivedKBytesPerSec" : 25966.10615693347,
    "sentKBytesPerSec" : 1645.5640579538692
  },
  "Create User" : {
    "transaction" : "Create User",
    "sampleCount" : 696115,
    "errorCount" : 690368,
    "errorPct" : 99.174416,
    "meanResTime" : 9.047914496886493,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 5008.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 58.0,
    "throughput" : 5753.87247689739,
    "receivedKBytesPerSec" : 7635.783854984626,
    "sentKBytesPerSec" : 672.6195015709982
  }
}